# Rebar Bar Type Set Crank Ratio Method

Source: https://www.revitapidocs.com/2026/2592660f-fb98-11d6-7e57-66e17131c4a4.htm

---

| Rebar Bar Type Set Crank Ratio Method |
| --- |

Sets the crank ratio for the specified Rebar Crank Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetCrankRatio(
	ElementId rebarCrankTypeId,
	double crankRatio
)
```

```
Public Sub SetCrankRatio (
	rebarCrankTypeId As ElementId,
	crankRatio As Double
)
```

```
public:
void SetCrankRatio(
	ElementId^ rebarCrankTypeId,
	double crankRatio
)
```

```
member SetCrankRatio :
        rebarCrankTypeId : ElementId *
        crankRatio : float -> unit
```

#### Parameters

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.
 Interactions with Rebar Crank Types can be done with the functions in \[!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils] .

crankRatio Double
:   The new value of the crank ratio.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category.  \-or\-  For the specified Rebar Crank Type is auto calculated and the cannot be manually set.  \-or\-  The crank parameters cannot be computed for the specified crankRatio and Rebar Crank Type. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | The given value for crankRatio must be positive. |

Remarks The crank slope is 1/crankRatio.
 When the crank ratio is set, the crank offset length is keeping the same value. The angled length and straight length are adjusted. See Also

#### Reference

RebarBarType Class Autodesk.Revit.DB.Structure Namespace